width = 3200;
height = 2000;
filepath='\\p5oanas.csot.tcl.com\oavdi\OAData\wujingjie1\Desktop\软件\oppo41色';
background_color = [255, 255, 255]; % 白色 (RGB)
circle_color = [
   255,255,255;
255,0,0;
255,126,0;
255,255,0;
0,255,0;
0,255,255;
0,130,255;
0,0,255;
158,0,255;
255,0,255;
255,0,151;
255,73,73;
255,148,88;
255,255,124;
110,255,110;
125,255,255;
93,150,255;
77,77,255;
170,86,255;
255,100,255;
255,83,163;
255,114,114;
255,169,134;
255,255,174;
160,255,160;
176,255,255;
140,174,255;
120,120,255;
186,132,255;
255,149,255;
255,128,180;
255,164,164;
255,202,185;
255,255,216;
206,255,206;
218,255,255;
190,207,255;
171,171,255;
211,182,255;
255,197,255;
255,178,206;
    ]; % 灰色 (RGB)



% 创建白色背景图像
bg_img = uint8(ones(height, width, 3));


for i=1:size(circle_color,1)
    for c=1:3
img(:,:,c)=bg_img(:,:,c)*circle_color(i,c);
    end

% 保存图像
filename=sprintf('C%d.png',i);
full_path=fullfile(filepath,filename);
imwrite(img,full_path);
fprintf('已生成:%s_ ', full_path);
end